In [5]:
import numpy as np #import bibliotek numpy i pandas
import pandas as pd

In [87]:
df_people = pd.read_csv('../../Pliki/02_pandas/people.csv') #zaczytanie pliku .csv people + utworzenie zmiennej df_people
df_people.head() # pokaznie tylko 5 rekord√≥w

      Name  Age       Location Occupation  Salary
0    Alice   28       New York   Engineer   80000
1      Bob   35    Los Angeles     Doctor  120000
2  Charlie   22        Chicago    Student       0
3    David   40  San Francisco    Manager   95000
4    Emily   29          Miami   Designer   75000

In [97]:
df_people['Length in cm'] = [178, 179, 182, 190, 189, 176, 165, 156, 166, 180, 165, 190, 201, 160, 179, 191]
# dodanie kolumny 'Length in cm' i 'age'
df_people['age'] = [78, 78, 82, 90, 38,38, 65, 56, 45, 33, 33, 45, 19, 46, 24, 31]
df_people

       Name  Age       Location      Occupation  Salary  Length in cm  age
0     Alice   28       New York        Engineer   80000           178   78
1       Bob   35    Los Angeles          Doctor  120000           179   78
2   Charlie   22        Chicago         Student       0           182   82
3     David   40  San Francisco         Manager   95000           190   90
4     Emily   29          Miami        Designer   75000           189   38
5     Frank   32         Boston         Teacher   60000           176   38
6     Grace   27        Seattle       Scientist  110000           165   65
7    Hannah   45         Dallas          Lawyer  130000           156   56
8       Ian   31         Denver          Writer   70000           166   45
9     Julia   24         Austin          Artist   55000           180   33
10    Karen   38        Houston      Accountant   90000           165   33
11     Liam   26        Phoenix    Photographer   50000           190   45
12    Megan   33       Portland       Architect  105000           201   19
13   Nathan   29        Atlanta        Musician   40000           160   46
14   Olivia   27        Detroit            Chef   65000           179   24
15     Paul   36    Minneapolis  Police Officer   85000           191   31

In [89]:
df_people.drop('age', axis=1) #dropniƒôcie kolumny 'age'

       Name  Age       Location      Occupation  Salary  Length in cm
0     Alice   28       New York        Engineer   80000           178
1       Bob   35    Los Angeles          Doctor  120000           179
2   Charlie   22        Chicago         Student       0           182
3     David   40  San Francisco         Manager   95000           190
4     Emily   29          Miami        Designer   75000           189
5     Frank   32         Boston         Teacher   60000           176
6     Grace   27        Seattle       Scientist  110000           165
7    Hannah   45         Dallas          Lawyer  130000           156
8       Ian   31         Denver          Writer   70000           166
9     Julia   24         Austin          Artist   55000           180
10    Karen   38        Houston      Accountant   90000           165
11     Liam   26        Phoenix    Photographer   50000           190
12    Megan   33       Portland       Architect  105000           201
13   Nathan   29        Atlanta        Musician   40000           160
14   Olivia   27        Detroit            Chef   65000           179
15     Paul   36    Minneapolis  Police Officer   85000           191

In [48]:
df_people # jak widaƒá jeszcze ta kolumna 'age' mimo usuniƒôcia jest jeszcze widoczna

       Name  Age       Location      Occupation  Salary  Length in cm  age
0     Alice   28       New York        Engineer   80000           178   78
1       Bob   35    Los Angeles          Doctor  120000           179   79
2   Charlie   22        Chicago         Student       0           182   82
3     David   40  San Francisco         Manager   95000           190   90
4     Emily   29          Miami        Designer   75000           189   34
5     Frank   32         Boston         Teacher   60000           176   23
6     Grace   27        Seattle       Scientist  110000           165   65
7    Hannah   45         Dallas          Lawyer  130000           156   56
8       Ian   31         Denver          Writer   70000           166   18
9     Julia   24         Austin          Artist   55000           180   23
10    Karen   38        Houston      Accountant   90000           165   33
11     Liam   26        Phoenix    Photographer   50000           190   45
12    Megan   33       Portland       Architect  105000           201   19
13   Nathan   29        Atlanta        Musician   40000           160   46
14   Olivia   27        Detroit            Chef   65000           179   24
15     Paul   36    Minneapolis  Police Officer   85000           191   31

In [90]:
df_people = df_people.drop('age', axis=1) # wy≈õwietlenie stanu tabeli po usuniƒôciu kolumny 'age'
df_people

       Name  Age       Location      Occupation  Salary  Length in cm
0     Alice   28       New York        Engineer   80000           178
1       Bob   35    Los Angeles          Doctor  120000           179
2   Charlie   22        Chicago         Student       0           182
3     David   40  San Francisco         Manager   95000           190
4     Emily   29          Miami        Designer   75000           189
5     Frank   32         Boston         Teacher   60000           176
6     Grace   27        Seattle       Scientist  110000           165
7    Hannah   45         Dallas          Lawyer  130000           156
8       Ian   31         Denver          Writer   70000           166
9     Julia   24         Austin          Artist   55000           180
10    Karen   38        Houston      Accountant   90000           165
11     Liam   26        Phoenix    Photographer   50000           190
12    Megan   33       Portland       Architect  105000           201
13   Nathan   29        Atlanta        Musician   40000           160
14   Olivia   27        Detroit            Chef   65000           179
15     Paul   36    Minneapolis  Police Officer   85000           191

In [44]:
df_people

       Name  Age       Location      Occupation  Salary  Length in cm
0     Alice   28       New York        Engineer   80000           178
1       Bob   35    Los Angeles          Doctor  120000           179
2   Charlie   22        Chicago         Student       0           182
3     David   40  San Francisco         Manager   95000           190
4     Emily   29          Miami        Designer   75000           189
5     Frank   32         Boston         Teacher   60000           176
6     Grace   27        Seattle       Scientist  110000           165
7    Hannah   45         Dallas          Lawyer  130000           156
8       Ian   31         Denver          Writer   70000           166
9     Julia   24         Austin          Artist   55000           180
10    Karen   38        Houston      Accountant   90000           165
11     Liam   26        Phoenix    Photographer   50000           190
12    Megan   33       Portland       Architect  105000           201
13   Nathan   29        Atlanta        Musician   40000           160
14   Olivia   27        Detroit            Chef   65000           179
15     Paul   36    Minneapolis  Police Officer   85000           191

In [91]:
df_people.info() # Dziƒôki metodzie 'info' mo≈ºemy sobie zobaczyƒá jakie typy kolumn sƒÖ uzyte w tej bazie (jakie metryki sƒÖ przypisane do kolumn) w naszym data frame 'df_house'.
# I teraz kolumna 'non-null' pokazuje ile wierszy nie jest pustych. Jak widaƒá mamy r√≥≈ºnice, co oznacza, ≈ºe w niekt√≥rych wierszach brakuje nam warto≈õci. Je≈õli warto≈õƒá jest ta sama dla wszystkich wierszy, to jest ok, ale je≈õli dla kt√≥rego≈õ jest inna, tzn. ≈ºe tam sƒÖ warto≈õci puste, czyli brakuje warto≈õci.
# W kolumnie 'Dtype' mamy jakie rodzaje typ√≥w warto≈õci sƒÖ w nich zawarte, i tak object = string, a inne ju≈º majƒÖ standardowe nazwy.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          16 non-null     object
 1   Age           16 non-null     int64
 2   Location      16 non-null     object
 3   Occupation    16 non-null     object
 4   Salary        16 non-null     int64
 5   Length in cm  16 non-null     int64
dtypes: int64(3), object(3)
memory usage: 896.0+ bytes

In [92]:
df_people.isna().sum() # dziƒôki tej metody 'isna()' mo≈ºemy zobaczyƒá ile w rzeczywisto≈õci brakuje wierszy w danych kolumnach, ktore nastƒôpnie sumujemy .sum(), zeby mieƒá pe≈Çny obraz.  W tej bazie nie brakuje ≈ºadnych.

Name            0
Age             0
Location        0
Occupation      0
Salary          0
Length in cm    0
dtype: int64

In [52]:
pd.set_option('display.float.format', lambda x: '%.5f' % x) # tutaj ustawiamy flagƒô dla Pandas, o nazwie 'display.float.format' + tu korzystamy z 'lambdy', aby ka≈ºdy z tych wierszy by≈Ç wyswietlany jako warto≈õƒá dziesiƒôtna, z 5 miejscami po przecinku

In [53]:
df_people.describe() # Bardzo przydatna Funkcja'describe' - za pomocƒÖ kt√≥rej wy≈õwietlamy podstawowe statystyki, gdzie mamy zawarte wszystkie numeryczne kolumny. Dziƒôki temu zobaczymy, czy nie ma jakich≈õ z≈Çych danych, np.min cena za 1m2=2grosze, za≈õ cena max=ponad 9mln z≈Ç.

           Age       Salary  Length in cm
count 16.00000     16.00000      16.00000
mean  31.37500  76875.00000     177.93750
std    6.18466  32755.40668      12.70941
min   22.00000      0.00000     156.00000
25%   27.00000  58750.00000     165.75000
50%   30.00000  77500.00000     179.00000
75%   35.25000  97500.00000     189.25000
max   45.00000 130000.00000     201.00000

In [54]:
df_people.describe(include='object') # teraz wy≈õwietlamy podstawowe statystyki, gdzie mamy zawarte wszystkie tekstowe (object) kolumny

         Name  Location Occupation
count      16        16         16
unique     16        16         16
top     Alice  New York   Engineer
freq        1         1          1

In [79]:
df_people.sort_values('Age') # tu sortujemy po ludzi po wieku

     Name  Age       Location      Occupation  Salary  Length in cm
6   Grace   27        Seattle       Scientist  110000           165
0   Alice   28       New York        Engineer   80000           178
4   Emily   29          Miami        Designer   75000           189
12  Megan   33       Portland       Architect  105000           201
1     Bob   35    Los Angeles          Doctor  120000           179
15   Paul   36    Minneapolis  Police Officer   85000           191
10  Karen   38        Houston      Accountant   90000           165
3   David   40  San Francisco         Manager   95000           190

In [63]:
df_people.sort_values('Salary', ascending=False) # tu sobie sortujemy po zarobkach, ale od najwiƒôkszych, do najmniejszych

     Name  Age       Location      Occupation  Salary  Length in cm
1     Bob   35    Los Angeles          Doctor  120000           179
6   Grace   27        Seattle       Scientist  110000           165
12  Megan   33       Portland       Architect  105000           201
3   David   40  San Francisco         Manager   95000           190
10  Karen   38        Houston      Accountant   90000           165
15   Paul   36    Minneapolis  Police Officer   85000           191
0   Alice   28       New York        Engineer   80000           178
4   Emily   29          Miami        Designer   75000           189

In [83]:
df_people = df_people[(df_people['Salary'] > 70000) & (df_people['Salary'] < 130000 )] #zawƒô≈ºanie zakresu zarobk√≥w
df_people

     Name  Age       Location      Occupation  Salary  Length in cm
0   Alice   28       New York        Engineer   80000           178
1     Bob   35    Los Angeles          Doctor  120000           179
3   David   40  San Francisco         Manager   95000           190
4   Emily   29          Miami        Designer   75000           189
6   Grace   27        Seattle       Scientist  110000           165
10  Karen   38        Houston      Accountant   90000           165
12  Megan   33       Portland       Architect  105000           201
15   Paul   36    Minneapolis  Police Officer   85000           191

In [84]:
df_people.sort_values('Salary') # sortowanie po zawƒô≈ºeniu zarobk√≥w, od najmniejszego, do najwiƒôkszego

     Name  Age       Location      Occupation  Salary  Length in cm
4   Emily   29          Miami        Designer   75000           189
0   Alice   28       New York        Engineer   80000           178
15   Paul   36    Minneapolis  Police Officer   85000           191
10  Karen   38        Houston      Accountant   90000           165
3   David   40  San Francisco         Manager   95000           190
12  Megan   33       Portland       Architect  105000           201
6   Grace   27        Seattle       Scientist  110000           165
1     Bob   35    Los Angeles          Doctor  120000           179

In [85]:
df_people.describe() # teraz widzimy statystyki po zawƒô≈ºeniu odno≈õnie 'Salary'

           Age       Salary  Length in cm
count  8.00000      8.00000       8.00000
mean  33.25000  95000.00000     182.25000
std    4.83292  15583.87445      12.85913
min   27.00000  75000.00000     165.00000
25%   28.75000  83750.00000     174.75000
50%   34.00000  92500.00000     184.00000
75%   36.50000 106250.00000     190.25000
max   40.00000 120000.00000     201.00000

In [100]:
df_people['age'].value_counts() #tu za pomocƒÖ funkcji '.value_counts' mo≈ºemy z danej kolumny wyciƒÖgnƒÖƒá istniejƒÖce tam r√≥≈ºne dane i je nastƒôpnie zsumowaƒá ile takich jest wystƒÖpie≈Ñ

age
78    2
38    2
45    2
33    2
82    1
90    1
65    1
56    1
19    1
46    1
24    1
31    1
Name: count, dtype: int64

### GRUPOWANIE

In [98]:
df_people.groupby ('age')['Salary'].sum() # korzystamy z metody 'group by', gdzie grupujemy po 'age' i 'Salary' + dajemy fuknkcjƒô agregujƒÖcƒÖ 'sum', kt√≥ra zsumuje wszystkie ceny pod konkretnego 'age'

age
19    105000
24     65000
31     85000
33    145000
38    135000
45    120000
46     40000
56    130000
65    110000
78    200000
82         0
90     95000
Name: Salary, dtype: int64

In [102]:
df_people.groupby('age')['Salary'].aggregate(['min', 'max']) #teraz grupujemy po dacie, po total price, ale za pomocƒÖ metody 'aggregate' pokazujemy kwoty min i max z 'total price' pofiltrowanych po dacie

        min     max
age
19   105000  105000
24    65000   65000
31    85000   85000
33    55000   90000
38    60000   75000
45    50000   70000
46    40000   40000
56   130000  130000
65   110000  110000
78    80000  120000
82        0       0
90    95000   95000